{"class_name":"Model","keras_version":"1.1.0","config":{"layers":[{"class_name":"InputLayer","config":{"batch_input_shape":[null,299,299,3],"input_dtype":"float32","sparse":false,"name":"input_1"},"inbound_nodes":[],"name":"input_1"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_1","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":3,"subsample":[2,2],"init":"glorot_uniform","bias":true,"nb_filter":32,"border_mode":"valid","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":3},"inbound_nodes":[[["input_1",0,0]]],"name":"convolution2d_1"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_1","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_1",0,0]]],"name":"batchnormalization_1"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_2","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":3,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":32,"border_mode":"valid","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":3},"inbound_nodes":[[["batchnormalization_1",0,0]]],"name":"convolution2d_2"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_2","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_2",0,0]]],"name":"batchnormalization_2"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_3","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":3,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":64,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":3},"inbound_nodes":[[["batchnormalization_2",0,0]]],"name":"convolution2d_3"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_3","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_3",0,0]]],"name":"batchnormalization_3"},{"class_name":"MaxPooling2D","config":{"name":"maxpooling2d_1","trainable":true,"dim_ordering":"tf","pool_size":[3,3],"strides":[2,2],"border_mode":"valid"},"inbound_nodes":[[["batchnormalization_3",0,0]]],"name":"maxpooling2d_1"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_4","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":1,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":80,"border_mode":"valid","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":1},"inbound_nodes":[[["maxpooling2d_1",0,0]]],"name":"convolution2d_4"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_4","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_4",0,0]]],"name":"batchnormalization_4"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_5","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":3,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":192,"border_mode":"valid","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":3},"inbound_nodes":[[["batchnormalization_4",0,0]]],"name":"convolution2d_5"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_5","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_5",0,0]]],"name":"batchnormalization_5"},{"class_name":"MaxPooling2D","config":{"name":"maxpooling2d_2","trainable":true,"dim_ordering":"tf","pool_size":[3,3],"strides":[2,2],"border_mode":"valid"},"inbound_nodes":[[["batchnormalization_5",0,0]]],"name":"maxpooling2d_2"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_9","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":1,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":64,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":1},"inbound_nodes":[[["maxpooling2d_2",0,0]]],"name":"convolution2d_9"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_9","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_9",0,0]]],"name":"batchnormalization_9"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_7","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":1,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":48,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":1},"inbound_nodes":[[["maxpooling2d_2",0,0]]],"name":"convolution2d_7"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_10","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":3,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":96,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":3},"inbound_nodes":[[["batchnormalization_9",0,0]]],"name":"convolution2d_10"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_7","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_7",0,0]]],"name":"batchnormalization_7"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_10","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_10",0,0]]],"name":"batchnormalization_10"},{"class_name":"AveragePooling2D","config":{"name":"averagepooling2d_1","trainable":true,"dim_ordering":"tf","pool_size":[3,3],"strides":[1,1],"border_mode":"same"},"inbound_nodes":[[["maxpooling2d_2",0,0]]],"name":"averagepooling2d_1"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_6","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":1,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":64,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":1},"inbound_nodes":[[["maxpooling2d_2",0,0]]],"name":"convolution2d_6"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_8","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":5,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":64,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":5},"inbound_nodes":[[["batchnormalization_7",0,0]]],"name":"convolution2d_8"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_11","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":3,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":96,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":3},"inbound_nodes":[[["batchnormalization_10",0,0]]],"name":"convolution2d_11"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_12","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":1,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":32,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":1},"inbound_nodes":[[["averagepooling2d_1",0,0]]],"name":"convolution2d_12"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_6","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_6",0,0]]],"name":"batchnormalization_6"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_8","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_8",0,0]]],"name":"batchnormalization_8"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_11","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_11",0,0]]],"name":"batchnormalization_11"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_12","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_12",0,0]]],"name":"batchnormalization_12"},{"class_name":"Merge","config":{"name":"mixed0","concat_axis":3,"mode_type":"raw","dot_axes":-1,"mode":"concat","output_shape":null,"output_shape_type":"raw"},"inbound_nodes":[[["batchnormalization_6",0,0],["batchnormalization_8",0,0],["batchnormalization_11",0,0],["batchnormalization_12",0,0]]],"name":"mixed0"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_16","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":1,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":64,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":1},"inbound_nodes":[[["mixed0",0,0]]],"name":"convolution2d_16"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_16","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_16",0,0]]],"name":"batchnormalization_16"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_14","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":1,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":48,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":1},"inbound_nodes":[[["mixed0",0,0]]],"name":"convolution2d_14"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_17","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":3,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":96,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":3},"inbound_nodes":[[["batchnormalization_16",0,0]]],"name":"convolution2d_17"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_14","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_14",0,0]]],"name":"batchnormalization_14"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_17","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_17",0,0]]],"name":"batchnormalization_17"},{"class_name":"AveragePooling2D","config":{"name":"averagepooling2d_2","trainable":true,"dim_ordering":"tf","pool_size":[3,3],"strides":[1,1],"border_mode":"same"},"inbound_nodes":[[["mixed0",0,0]]],"name":"averagepooling2d_2"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_13","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":1,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":64,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":1},"inbound_nodes":[[["mixed0",0,0]]],"name":"convolution2d_13"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_15","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":5,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":64,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":5},"inbound_nodes":[[["batchnormalization_14",0,0]]],"name":"convolution2d_15"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_18","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":3,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":96,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":3},"inbound_nodes":[[["batchnormalization_17",0,0]]],"name":"convolution2d_18"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_19","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":1,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":32,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":1},"inbound_nodes":[[["averagepooling2d_2",0,0]]],"name":"convolution2d_19"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_13","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_13",0,0]]],"name":"batchnormalization_13"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_15","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_15",0,0]]],"name":"batchnormalization_15"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_18","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_18",0,0]]],"name":"batchnormalization_18"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_19","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_19",0,0]]],"name":"batchnormalization_19"},{"class_name":"Merge","config":{"name":"mixed1","concat_axis":3,"mode_type":"raw","dot_axes":-1,"mode":"concat","output_shape":null,"output_shape_type":"raw"},"inbound_nodes":[[["batchnormalization_13",0,0],["batchnormalization_15",0,0],["batchnormalization_18",0,0],["batchnormalization_19",0,0]]],"name":"mixed1"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_23","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":1,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":64,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":1},"inbound_nodes":[[["mixed1",0,0]]],"name":"convolution2d_23"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_23","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_23",0,0]]],"name":"batchnormalization_23"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_21","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":1,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":48,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":1},"inbound_nodes":[[["mixed1",0,0]]],"name":"convolution2d_21"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_24","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":3,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":96,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":3},"inbound_nodes":[[["batchnormalization_23",0,0]]],"name":"convolution2d_24"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_21","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_21",0,0]]],"name":"batchnormalization_21"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_24","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_24",0,0]]],"name":"batchnormalization_24"},{"class_name":"AveragePooling2D","config":{"name":"averagepooling2d_3","trainable":true,"dim_ordering":"tf","pool_size":[3,3],"strides":[1,1],"border_mode":"same"},"inbound_nodes":[[["mixed1",0,0]]],"name":"averagepooling2d_3"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_20","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":1,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":64,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":1},"inbound_nodes":[[["mixed1",0,0]]],"name":"convolution2d_20"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_22","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":5,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":64,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":5},"inbound_nodes":[[["batchnormalization_21",0,0]]],"name":"convolution2d_22"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_25","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":3,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":96,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":3},"inbound_nodes":[[["batchnormalization_24",0,0]]],"name":"convolution2d_25"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_26","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":1,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":32,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":1},"inbound_nodes":[[["averagepooling2d_3",0,0]]],"name":"convolution2d_26"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_20","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_20",0,0]]],"name":"batchnormalization_20"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_22","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_22",0,0]]],"name":"batchnormalization_22"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_25","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_25",0,0]]],"name":"batchnormalization_25"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_26","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_26",0,0]]],"name":"batchnormalization_26"},{"class_name":"Merge","config":{"name":"mixed2","concat_axis":3,"mode_type":"raw","dot_axes":-1,"mode":"concat","output_shape":null,"output_shape_type":"raw"},"inbound_nodes":[[["batchnormalization_20",0,0],["batchnormalization_22",0,0],["batchnormalization_25",0,0],["batchnormalization_26",0,0]]],"name":"mixed2"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_28","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":1,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":64,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":1},"inbound_nodes":[[["mixed2",0,0]]],"name":"convolution2d_28"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_28","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_28",0,0]]],"name":"batchnormalization_28"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_29","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":3,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":96,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":3},"inbound_nodes":[[["batchnormalization_28",0,0]]],"name":"convolution2d_29"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_29","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_29",0,0]]],"name":"batchnormalization_29"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_27","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":3,"subsample":[2,2],"init":"glorot_uniform","bias":true,"nb_filter":384,"border_mode":"valid","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":3},"inbound_nodes":[[["mixed2",0,0]]],"name":"convolution2d_27"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_30","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":3,"subsample":[2,2],"init":"glorot_uniform","bias":true,"nb_filter":96,"border_mode":"valid","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":3},"inbound_nodes":[[["batchnormalization_29",0,0]]],"name":"convolution2d_30"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_27","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_27",0,0]]],"name":"batchnormalization_27"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_30","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_30",0,0]]],"name":"batchnormalization_30"},{"class_name":"MaxPooling2D","config":{"name":"maxpooling2d_3","trainable":true,"dim_ordering":"tf","pool_size":[3,3],"strides":[2,2],"border_mode":"valid"},"inbound_nodes":[[["mixed2",0,0]]],"name":"maxpooling2d_3"},{"class_name":"Merge","config":{"name":"mixed3","concat_axis":3,"mode_type":"raw","dot_axes":-1,"mode":"concat","output_shape":null,"output_shape_type":"raw"},"inbound_nodes":[[["batchnormalization_27",0,0],["batchnormalization_30",0,0],["maxpooling2d_3",0,0]]],"name":"mixed3"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_35","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":1,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":128,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":1},"inbound_nodes":[[["mixed3",0,0]]],"name":"convolution2d_35"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_35","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_35",0,0]]],"name":"batchnormalization_35"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_36","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":1,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":128,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":7},"inbound_nodes":[[["batchnormalization_35",0,0]]],"name":"convolution2d_36"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_36","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_36",0,0]]],"name":"batchnormalization_36"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_32","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":1,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":128,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":1},"inbound_nodes":[[["mixed3",0,0]]],"name":"convolution2d_32"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_37","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":7,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":128,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":1},"inbound_nodes":[[["batchnormalization_36",0,0]]],"name":"convolution2d_37"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_32","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_32",0,0]]],"name":"batchnormalization_32"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_37","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_37",0,0]]],"name":"batchnormalization_37"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_33","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":7,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":128,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":1},"inbound_nodes":[[["batchnormalization_32",0,0]]],"name":"convolution2d_33"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_38","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":1,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":128,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":7},"inbound_nodes":[[["batchnormalization_37",0,0]]],"name":"convolution2d_38"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_33","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_33",0,0]]],"name":"batchnormalization_33"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_38","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_38",0,0]]],"name":"batchnormalization_38"},{"class_name":"AveragePooling2D","config":{"name":"averagepooling2d_4","trainable":true,"dim_ordering":"tf","pool_size":[3,3],"strides":[1,1],"border_mode":"same"},"inbound_nodes":[[["mixed3",0,0]]],"name":"averagepooling2d_4"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_31","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":1,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":192,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":1},"inbound_nodes":[[["mixed3",0,0]]],"name":"convolution2d_31"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_34","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":1,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":192,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":7},"inbound_nodes":[[["batchnormalization_33",0,0]]],"name":"convolution2d_34"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_39","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":7,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":192,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":1},"inbound_nodes":[[["batchnormalization_38",0,0]]],"name":"convolution2d_39"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_40","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":1,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":192,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":1},"inbound_nodes":[[["averagepooling2d_4",0,0]]],"name":"convolution2d_40"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_31","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_31",0,0]]],"name":"batchnormalization_31"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_34","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_34",0,0]]],"name":"batchnormalization_34"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_39","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_39",0,0]]],"name":"batchnormalization_39"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_40","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_40",0,0]]],"name":"batchnormalization_40"},{"class_name":"Merge","config":{"name":"mixed4","concat_axis":3,"mode_type":"raw","dot_axes":-1,"mode":"concat","output_shape":null,"output_shape_type":"raw"},"inbound_nodes":[[["batchnormalization_31",0,0],["batchnormalization_34",0,0],["batchnormalization_39",0,0],["batchnormalization_40",0,0]]],"name":"mixed4"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_45","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":1,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":160,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":1},"inbound_nodes":[[["mixed4",0,0]]],"name":"convolution2d_45"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_45","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_45",0,0]]],"name":"batchnormalization_45"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_46","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":1,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":160,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":7},"inbound_nodes":[[["batchnormalization_45",0,0]]],"name":"convolution2d_46"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_46","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_46",0,0]]],"name":"batchnormalization_46"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_42","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":1,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":160,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":1},"inbound_nodes":[[["mixed4",0,0]]],"name":"convolution2d_42"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_47","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":7,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":160,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":1},"inbound_nodes":[[["batchnormalization_46",0,0]]],"name":"convolution2d_47"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_42","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_42",0,0]]],"name":"batchnormalization_42"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_47","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_47",0,0]]],"name":"batchnormalization_47"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_43","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":7,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":160,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":1},"inbound_nodes":[[["batchnormalization_42",0,0]]],"name":"convolution2d_43"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_48","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":1,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":160,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":7},"inbound_nodes":[[["batchnormalization_47",0,0]]],"name":"convolution2d_48"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_43","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_43",0,0]]],"name":"batchnormalization_43"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_48","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_48",0,0]]],"name":"batchnormalization_48"},{"class_name":"AveragePooling2D","config":{"name":"averagepooling2d_5","trainable":true,"dim_ordering":"tf","pool_size":[3,3],"strides":[1,1],"border_mode":"same"},"inbound_nodes":[[["mixed4",0,0]]],"name":"averagepooling2d_5"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_41","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":1,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":192,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":1},"inbound_nodes":[[["mixed4",0,0]]],"name":"convolution2d_41"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_44","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":1,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":192,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":7},"inbound_nodes":[[["batchnormalization_43",0,0]]],"name":"convolution2d_44"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_49","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":7,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":192,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":1},"inbound_nodes":[[["batchnormalization_48",0,0]]],"name":"convolution2d_49"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_50","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":1,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":192,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":1},"inbound_nodes":[[["averagepooling2d_5",0,0]]],"name":"convolution2d_50"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_41","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_41",0,0]]],"name":"batchnormalization_41"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_44","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_44",0,0]]],"name":"batchnormalization_44"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_49","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_49",0,0]]],"name":"batchnormalization_49"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_50","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_50",0,0]]],"name":"batchnormalization_50"},{"class_name":"Merge","config":{"name":"mixed5","concat_axis":3,"mode_type":"raw","dot_axes":-1,"mode":"concat","output_shape":null,"output_shape_type":"raw"},"inbound_nodes":[[["batchnormalization_41",0,0],["batchnormalization_44",0,0],["batchnormalization_49",0,0],["batchnormalization_50",0,0]]],"name":"mixed5"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_55","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":1,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":160,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":1},"inbound_nodes":[[["mixed5",0,0]]],"name":"convolution2d_55"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_55","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_55",0,0]]],"name":"batchnormalization_55"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_56","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":1,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":160,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":7},"inbound_nodes":[[["batchnormalization_55",0,0]]],"name":"convolution2d_56"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_56","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_56",0,0]]],"name":"batchnormalization_56"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_52","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":1,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":160,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":1},"inbound_nodes":[[["mixed5",0,0]]],"name":"convolution2d_52"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_57","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":7,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":160,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":1},"inbound_nodes":[[["batchnormalization_56",0,0]]],"name":"convolution2d_57"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_52","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_52",0,0]]],"name":"batchnormalization_52"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_57","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_57",0,0]]],"name":"batchnormalization_57"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_53","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":7,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":160,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":1},"inbound_nodes":[[["batchnormalization_52",0,0]]],"name":"convolution2d_53"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_58","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":1,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":160,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":7},"inbound_nodes":[[["batchnormalization_57",0,0]]],"name":"convolution2d_58"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_53","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_53",0,0]]],"name":"batchnormalization_53"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_58","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_58",0,0]]],"name":"batchnormalization_58"},{"class_name":"AveragePooling2D","config":{"name":"averagepooling2d_6","trainable":true,"dim_ordering":"tf","pool_size":[3,3],"strides":[1,1],"border_mode":"same"},"inbound_nodes":[[["mixed5",0,0]]],"name":"averagepooling2d_6"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_51","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":1,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":192,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":1},"inbound_nodes":[[["mixed5",0,0]]],"name":"convolution2d_51"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_54","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":1,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":192,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":7},"inbound_nodes":[[["batchnormalization_53",0,0]]],"name":"convolution2d_54"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_59","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":7,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":192,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":1},"inbound_nodes":[[["batchnormalization_58",0,0]]],"name":"convolution2d_59"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_60","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":1,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":192,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":1},"inbound_nodes":[[["averagepooling2d_6",0,0]]],"name":"convolution2d_60"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_51","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_51",0,0]]],"name":"batchnormalization_51"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_54","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_54",0,0]]],"name":"batchnormalization_54"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_59","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_59",0,0]]],"name":"batchnormalization_59"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_60","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_60",0,0]]],"name":"batchnormalization_60"},{"class_name":"Merge","config":{"name":"mixed6","concat_axis":3,"mode_type":"raw","dot_axes":-1,"mode":"concat","output_shape":null,"output_shape_type":"raw"},"inbound_nodes":[[["batchnormalization_51",0,0],["batchnormalization_54",0,0],["batchnormalization_59",0,0],["batchnormalization_60",0,0]]],"name":"mixed6"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_65","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":1,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":160,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":1},"inbound_nodes":[[["mixed6",0,0]]],"name":"convolution2d_65"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_65","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_65",0,0]]],"name":"batchnormalization_65"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_66","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":1,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":192,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":7},"inbound_nodes":[[["batchnormalization_65",0,0]]],"name":"convolution2d_66"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_66","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_66",0,0]]],"name":"batchnormalization_66"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_62","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":1,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":192,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":1},"inbound_nodes":[[["mixed6",0,0]]],"name":"convolution2d_62"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_67","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":7,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":192,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":1},"inbound_nodes":[[["batchnormalization_66",0,0]]],"name":"convolution2d_67"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_62","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_62",0,0]]],"name":"batchnormalization_62"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_67","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_67",0,0]]],"name":"batchnormalization_67"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_63","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":7,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":192,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":1},"inbound_nodes":[[["batchnormalization_62",0,0]]],"name":"convolution2d_63"},{"class_name":"Convolution2D","config":{"W_constraint":null,"b_constraint":null,"name":"convolution2d_68","activity_regularizer":null,"trainable":true,"dim_ordering":"tf","nb_col":1,"subsample":[1,1],"init":"glorot_uniform","bias":true,"nb_filter":192,"border_mode":"same","b_regularizer":null,"W_regularizer":null,"activation":"relu","nb_row":7},"inbound_nodes":[[["batchnormalization_67",0,0]]],"name":"convolution2d_68"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_63","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_63",0,0]]],"name":"batchnormalization_63"},{"class_name":"BatchNormalization","config":{"gamma_regularizer":null,"name":"batchnormalization_68","epsilon":1e-05,"trainable":true,"mode":0,"beta_regularizer":null,"momentum":0.99,"axis":3},"inbound_nodes":[[["convolution2d_68",0,0]]],"name":"batchnormalization_68"},{"class_name":"AveragePooling2D","config":{"name":"averagepooling2d_7","trainable":true,"dim_ordering":"tf","pool_size":[3,3],"strides":[1,1],